smLab_test/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ПартииТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

smLab_test/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

smLab_test/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполненитьДанныеФормы();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполненитьДанныеФормы();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполненитьДанныеФормы();
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;	
		 	
	Элементы.Товары.ТекущиеДанные.ТипНоменклатуры = ПолучитьЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Номенклатура, "Тип");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбщегоНазначенияКлиентСервер.ДобавитьПростойЭлементУсловногоОформления(ЭтотОбъект, "ТоварыСклад", "ОтметкаНезаполненного",
		Ложь, "Объект.Товары.ТипНоменклатуры", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ТипыНоменклатуры.Услуга);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполненитьДанныеФормы()
	
	ТаблицаНоменклатуры = Объект.Товары.Выгрузить(,"Номенклатура");
	МассивНоменклатуры = ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивНоменклатуры, Справочники.Номенклатура.ПустаяСсылка());
	
	ЗначенияТиповНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНоменклатуры,"Тип");
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
		СтрокаТовары.ТипНоменклатуры = ЗначенияТиповНоменклатуры.Получить(СтрокаТовары.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьЗначениеРеквизитаОбъекта(Ссылка, Реквизит)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);
КонецФункции

#КонецОбласти
